// Доставка на храна

// Ресторант отваря врати и предлага няколко менюта на преференциални цени:

// • Пилешко меню – 10.35 лв.

// • Меню с риба – 12.40 лв.

// • Вегетарианско меню – 8.15 лв.

// Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.

// Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).

// Цената на доставка е 2.50 лв и се начислява най-накрая.

// Вход

// От конзолата се четат 3 реда:

// · Брой пилешки менюта – цяло число в интервала [0 … 99]

// · Брой менюта с риба – цяло число в интервала [0 … 99]

// · Брой вегетариански менюта – цяло число в интервала [0 … 99]

// Изход

// Да се отпечата на конзолата един ред: "{цена на поръчката}"


function food(input) {
    let chikenMenu = (Number(input[0]) * 10.35);
    let fishMenu = (Number(input[1]) * 12.40);
    let veganMenu = (Number(input[2]) * 8.15);
    let sumMenu= (chikenMenu + fishMenu + veganMenu);
    let priceDesert =  (sumMenu  /100 ) * 20;  // 
    let dostavka = 2.50;
    let totalSum= sumMenu + priceDesert + dostavka;
    // може и така да се вземе сумата на менюто като по горе не се декларират цени
    // let totalMenu = chikenMenu * 10.35 + fishMenu * 12.40 + veganMenu * 8.15;
    //let priceDesert=0.20*totalMenu;
console.log(totalSum);
}
food(["2 ",

"4 ",

"3 "]);