/*1.	Приемете вход (число във вид на стринг) и  го запазете в променливата a, като го преобразувате към числен тип. 
2.	Инициализирайте променлива, която държи пресметнатата стойност на лицето, получена по формулата
 a * a и принтирайте резултата, като не забравяйте, че за да получите локално резултат, трябва да извикате функцията и да й подадете входни данни.
вход 5 / изход 25
*/ 

function sqareArea(input) {
    let a = Number(input[0]);
    let area = a * a;
    console.log(area);
}
sqareArea(["5"])
