/**8.	Зоомагазин
Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки.  Храната се пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв, а опаковка храна за котки струва 4 лв.
Вход
От конзолата се четат 2 реда:
1.	Броят на опаковките храна за кучета – цяло число в интервала [0… 100]
2.	Броят на опаковките храна за котки –  цяло число в интервала [0… 100]
Изход
На конзолата се отпечатва: 
"{крайната сума} lv."
 */

function zoomagazin(input) {
    let dog = input[0];
    let cat = input[1];
    let dogPrice = (dog * 2.50);
    let catPrice = (cat * 4);
    let totalSum = (dogPrice + catPrice);
    console.log(`${totalSum} lv.`);
}
zoomagazin(["5" ,"4"])